ax-rwnd/rust-lpc1347/LPC13Uxx_patched.svd
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>PWMC</name>																					
		<description>PWM Control Register. The PWMCON enables PWM mode for the external match pins CT32Bn_MAT\[3:0\].</description>																					
		<addressOffset>0x074</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>PWMEN0</name>																			
				<description>PWM mode enable for channel0.</description>																			
				<bitRange>[0:0]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>CT32BN_MAT0_IS_CONTR</name>																	
						<description>CT32Bn_MAT0 is controlled by EM0.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>PWM_MODE_IS_ENABLED_</name>																	
						<description>PWM mode is enabled for CT32Bn_MAT0.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>PWMEN1</name>																			
				<description>PWM mode enable for channel1.</description>																			
				<bitRange>[1:1]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>CT32BN_MAT01_IS_CONT</name>																	
						<description>CT32Bn_MAT01 is controlled by EM1.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>PWM_MODE_IS_ENABLED_</name>																	
						<description>PWM mode is enabled for CT32Bn_MAT1.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>PWMEN2</name>																			
				<description>PWM mode enable for channel2.</description>																			
				<bitRange>[2:2]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>CT32BN_MAT2_IS_CONTR</name>																	
						<description>CT32Bn_MAT2 is controlled by EM2.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>PWM_MODE_IS_ENABLED_</name>																	
						<description>PWM mode is enabled for CT32Bn_MAT2.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>PWMEN3</name>																			
				<description>PWM mode enable for channel3. Note: It is recommended to use match channel 3 to set the PWM cycle.</description>																			
				<bitRange>[3:3]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>CT32BN_MAT3_IS_CONTR</name>																	
						<description>CT32Bn_MAT3 is controlled by EM3.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>PWM_MODE_IS_ENABLED_</name>																	
						<description>PWM mode is enabled for CT132Bn_MAT3.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>																			
				<bitRange>[31:4]</bitRange>																			
																						
			</field>																				
		</fields>																					
	</register>																						
</registers>
		</peripheral>
		
		<peripheral>
			<name>USART</name>
			<description>USART</description>
			<groupName>USART</groupName>
			<baseAddress>0x40008000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>USART</name>
				<value>21</value>
			</interrupt>
			<registers>
				<register>
					<name>RBR</name>
					<description>Receiver Buffer Register. Contains the next received character to be read. (DLAB=0)</description>
					<addressOffset>0x000</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<readAction>modify</readAction>
					<fields>
						<field>
							<name>RBR</name>
							<description>The USART Receiver Buffer Register contains the oldest received byte in the USART RX FIFO.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>THR</name>
					<description>Transmit Holding Register. The next character to be transmitted is written here. (DLAB=0)</description>
					<alternateRegister>RBR</alternateRegister>
					<addressOffset>0x000</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<readAction>modify</readAction>
					<fields>
						<field>
							<name>THR</name>
							<description>Writing to the USART Transmit Holding Register causes the data to be stored in the USART transmit FIFO. The byte will be sent when it is the oldest byte in the FIFO and the transmitter is available.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DLL</name>
					<description>Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB=1)</description>
					<alternateRegister>RBR</alternateRegister>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x01</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DLLSB</name>
							<description>The USART Divisor Latch LSB Register, along with the DLM register, determines the baud rate of the USART.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DLM</name>
					<description>Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB=1)</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DLMSB</name>
							<description>The USART Divisor Latch MSB Register, along with the DLL register, determines the baud rate of the USART.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>IER</name>
					<description>Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential USART interrupts. (DLAB=0)</description>
					<alternateRegister>DLM</alternateRegister>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RBRINTEN</name>
							<description>RBR Interrupt Enable. Enables the Receive Data Available interrupt. It also controls the Character Receive Time-out interrupt.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_THE_RDA_INTE</name>
									<description>Disable the RDA interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_THE_RDA_INTER</name>
									<description>Enable the RDA interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>THREINTEN</name>
							<description>THRE Interrupt Enable. Enables the THRE interrupt. The status of this interrupt can be read from LSR\[\5\].</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_THE_THRE_INT</name>
									<description>Disable the THRE interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_THE_THRE_INTE</name>
									<description>Enable the THRE interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RLSINTEN</name>
							<description>Enables the Receive Line Status interrupt. The status of this interrupt can be read from LSR\[4:1\].</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_THE_RLS_INTE</name>
									<description>Disable the RLS interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_THE_RLS_INTER</name>
									<description>Enable the RLS interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSINTEN</name>
							<description>Enables the Modem Status interrupt. The components of this interrupt can be read from the MSR.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_THE_MS_INTER</name>
									<description>Disable the MS interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_THE_MS_INTERR</name>
									<description>Enable the MS interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[7:4]</bitRange>

