ax-rwnd/rust-lpc1347/LPC13Uxx_patched.svd
			</field>															
			<field>															
				<name>I2CMODE</name>														
				<description>Selects I2C mode (see Section 6.3.8). Select Standard mode (I2CMODE = 0, default) or Standard I/O functionality (I2CMODE = 1) if the pin function is GPIO (FUNC = 0).</description>														
				<bitRange>[9:8]</bitRange>														
				<enumeratedValues>														
				<name>ENUM</name>														
					<enumeratedValue>													
						<name>STANDARD_MODE_FAST</name>												
						<description>Standard mode/ Fast-mode I2C.</description>												
						<value>0x0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>STANDARD_IO_FUNCTIO</name>												
						<description>Standard I/O functionality</description>												
						<value>0x1</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>FAST_MODE_PLUS_I2C</name>												
						<description>Fast-mode Plus I2C</description>												
						<value>0x2</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>RESERVED_0X3</name>												
						<description>Reserved.</description>												
						<value>0x3</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>RESERVED</name>														
				<description>Reserved.</description>														
				<bitRange>[31:10]</bitRange>														
													
			</field>															
		</fields>																
	</register>																	
	<register>																	
		<name>PIO0_5</name>																
		<description>I/O configuration for pin PIO0_5/SDA</description>																
		<addressOffset>0x014</addressOffset>																
		<access>read-write</access>																
		<resetValue>0x0000080</resetValue>																
		<resetMask>0xFFFFFFFF</resetMask>																
		<fields>																
			<field>															
				<name>FUNC</name>														
				<description>Selects pin function. Values 0x2 to 0x7 are reserved.</description>														
				<bitRange>[2:0]</bitRange>														
				<enumeratedValues>														
				<name>ENUM</name>														
					<enumeratedValue>													
						<name>PIO0_5_OPEN_DRAIN_P</name>												
						<description>PIO0_5 (open-drain pin).</description>												
						<value>0x0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>I2C_SDA_OPEN_DRAIN_</name>												
						<description>I2C SDA (open-drain pin).</description>												
						<value>0x1</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>I2CMODE</name>														
				<description>Selects I2C mode (see Section 6.3.8). Select Standard mode (I2CMODE = 00, default) or Standard I/O functionality (I2CMODE = 01) if the pin function is GPIO (FUNC = 0).</description>														
				<bitRange>[9:8]</bitRange>														
				<enumeratedValues>														
				<name>ENUM</name>														
					<enumeratedValue>													
						<name>STANDARD_MODE_FAST</name>												
						<description>Standard mode/ Fast-mode I2C.</description>												
						<value>0x0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>STANDARD_IO_FUNCTIO</name>												
						<description>Standard I/O functionality</description>												
						<value>0x1</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>FAST_MODE_PLUS_I2C</name>												
						<description>Fast-mode Plus I2C</description>												
						<value>0x2</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>RESERVED_0X3</name>												
						<description>Reserved.</description>												
						<value>0x3</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>RESERVED</name>														
				<description>Reserved.</description>														
				<bitRange>[31:10]</bitRange>														
													
			</field>															
		</fields>																
	</register>																	
	<register>																	
		<name>PIO0_6</name>																
		<description>I/O configuration for pin PIO0_6/USB_CONNECT/SCK0</description>																
		<addressOffset>0x018</addressOffset>																
		<access>read-write</access>																
		<resetValue>0x0000090</resetValue>																
		<resetMask>0xFFFFFFFF</resetMask>																
		<fields>																
			<field>															
				<name>FUNC</name>														
				<description>Selects pin function. Values 0x3 to 0x7 are reserved.</description>														
				<bitRange>[2:0]</bitRange>														
				<enumeratedValues>														
				<name>ENUM</name>														
					<enumeratedValue>													
						<name>PIO0_6_</name>												
						<description>PIO0_6.</description>												
						<value>0x0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>USB_CONNECT_</name>												
						<description>USB_CONNECT.</description>												
						<value>0x1</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>SCK0_</name>												
						<description>SCK0.</description>												
						<value>0x2</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>MODE</name>														
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>														
				<bitRange>[4:3]</bitRange>														
				<enumeratedValues>														
				<name>ENUM</name>														
					<enumeratedValue>													
						<name>INACTIVE_NO_PULL_DO</name>												
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>												
						<value>0x0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>PULL_DOWN_RESISTOR_E</name>												
						<description>Pull-down resistor enabled.</description>												
						<value>0x1</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>PULL_UP_RESISTOR_ENA</name>												
						<description>Pull-up resistor enabled.</description>												
						<value>0x2</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>REPEATER_MODE_</name>												
						<description>Repeater mode.</description>												
						<value>0x3</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>HYS</name>														
				<description>Hysteresis.</description>														
				<bitRange>[5:5]</bitRange>														
				<enumeratedValues>														
				<name>ENUM</name>														
					<enumeratedValue>													
						<name>DISABLE_</name>												
						<description>Disable.</description>												
						<value>0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>ENABLE_</name>												
						<description>Enable.</description>												
						<value>1</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>INV</name>														
				<description>Invert input</description>														
				<bitRange>[6:6]</bitRange>														
				<enumeratedValues>														
				<name>ENUM</name>														
					<enumeratedValue>													
						<name>INPUT_NOT_INVERTED_</name>												
						<description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0).</description>												
						<value>0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>INPUT_INVERTED_HIGH</name>												
						<description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>												
						<value>1</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>RESERVED</name>														
				<description>Reserved.</description>														
				<bitRange>[9:7]</bitRange>														
													
