ax-rwnd/rust-lpc1347/LPC13Uxx_patched.svd
			</field>															
		</fields>																
	</register>																	
	<register>																	
		<name>TDI_PIO0_11</name>																
		<description>I/O configuration for pin TDI/PIO0_11/AD0/CT32B0_MAT3</description>																
		<addressOffset>0x02C</addressOffset>																
		<access>read-write</access>																
		<resetValue>0x0000090</resetValue>																
		<resetMask>0xFFFFFFFF</resetMask>																
		<fields>																
			<field>															
				<name>FUNC</name>														
				<description>Selects pin function. Values 0x4 to 0x7 are reserved.</description>														
				<bitRange>[2:0]</bitRange>														
				<enumeratedValues>														
				<name>ENUM</name>														
					<enumeratedValue>													
						<name>TDI_</name>												
						<description>TDI.</description>												
						<value>0x0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>PIO0_11_</name>												
						<description>PIO0_11.</description>												
						<value>0x1</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>AD0_</name>												
						<description>AD0.</description>												
						<value>0x2</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>CT32B0_MAT3_</name>												
						<description>CT32B0_MAT3.</description>												
						<value>0x3</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>MODE</name>														
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>														
				<bitRange>[4:3]</bitRange>														
				<enumeratedValues>														
				<name>ENUM</name>														
					<enumeratedValue>													
						<name>INACTIVE_NO_PULL_DO</name>												
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>												
						<value>0x0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>PULL_DOWN_RESISTOR_E</name>												
						<description>Pull-down resistor enabled.</description>												
						<value>0x1</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>PULL_UP_RESISTOR_ENA</name>												
						<description>Pull-up resistor enabled.</description>												
						<value>0x2</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>REPEATER_MODE_</name>												
						<description>Repeater mode.</description>												
						<value>0x3</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>HYS</name>														
				<description>Hysteresis.</description>														
				<bitRange>[5:5]</bitRange>														
				<enumeratedValues>														
				<name>ENUM</name>														
					<enumeratedValue>													
						<name>DISABLE_</name>												
						<description>Disable.</description>												
						<value>0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>ENABLE_</name>												
						<description>Enable.</description>												
						<value>1</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>INV</name>														
				<description>Invert input</description>														
				<bitRange>[6:6]</bitRange>														
				<enumeratedValues>														
				<name>ENUM</name>														
					<enumeratedValue>													
						<name>INPUT_NOT_INVERTED_</name>												
						<description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0).</description>												
						<value>0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>INPUT_INVERTED_HIGH</name>												
						<description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>												
						<value>1</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>ADMODE</name>														
				<description>Selects Analog/Digital mode.</description>														
				<bitRange>[7:7]</bitRange>														
				<enumeratedValues>														
				<name>ENUM</name>														
					<enumeratedValue>													
						<name>ANALOG_INPUT_MODE_</name>												
						<description>Analog input mode.</description>												
						<value>0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>DIGITAL_FUNCTIONAL_M</name>												
						<description>Digital functional mode.</description>												
						<value>1</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>FILTR</name>														
				<description>Selects 10 ns input glitch filter.</description>														
				<bitRange>[8:8]</bitRange>														
				<enumeratedValues>														
				<name>ENUM</name>														
					<enumeratedValue>													
						<name>FILTER_ENABLED_</name>												
						<description>Filter enabled.</description>												
						<value>0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>FILTER_DISABLED_</name>												
						<description>Filter disabled.</description>												
						<value>1</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>RESERVED</name>														
				<description>Reserved.</description>														
				<bitRange>[9:9]</bitRange>														
													
