ax-rwnd/rust-lpc1347/LPC13Uxx_patched.svd
			</field>															
		</fields>																
	</register>																	
	<register>																	
		<name>PIO1_22</name>																
		<description>I/O configuration for pin PIO1_22/RI/MOSI1</description>																
		<addressOffset>0x0B8</addressOffset>																
		<access>read-write</access>																
		<resetValue>0x0000090</resetValue>																
		<resetMask>0xFFFFFFFF</resetMask>																
		<fields>																
			<field>															
				<name>FUNC</name>														
				<description>Selects pin function. Values 0x3 to 0x7 are reserved.</description>														
				<bitRange>[2:0]</bitRange>														
																		
				<enumeratedValues>														
				<name>ENUM</name>														
																		
					<enumeratedValue>													
						<name>PIO1_22_</name>												
						<description>PIO1_22.</description>												
						<value>0x0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>RI_</name>												
						<description>RI.</description>												
						<value>0x1</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>MOSI1_</name>												
						<description>MOSI1.</description>												
						<value>0x2</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>MODE</name>														
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>														
				<bitRange>[4:3]</bitRange>														
																		
				<enumeratedValues>														
				<name>ENUM</name>														
																		
					<enumeratedValue>													
						<name>INACTIVE_NO_PULL_DO</name>												
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>												
						<value>0x0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>PULL_DOWN_RESISTOR_E</name>												
						<description>Pull-down resistor enabled.</description>												
						<value>0x1</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>PULL_UP_RESISTOR_ENA</name>												
						<description>Pull-up resistor enabled.</description>												
						<value>0x2</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>REPEATER_MODE_</name>												
						<description>Repeater mode.</description>												
						<value>0x3</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>HYS</name>														
				<description>Hysteresis.</description>														
				<bitRange>[5:5]</bitRange>														
																		
				<enumeratedValues>														
				<name>ENUM</name>														
																		
					<enumeratedValue>													
						<name>DISABLE_</name>												
						<description>Disable.</description>												
						<value>0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>ENABLE_</name>												
						<description>Enable.</description>												
						<value>1</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>INV</name>														
				<description>Invert input</description>														
				<bitRange>[6:6]</bitRange>														
																		
				<enumeratedValues>														
				<name>ENUM</name>														
																		
					<enumeratedValue>													
						<name>INPUT_NOT_INVERTED_</name>												
						<description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0).</description>												
						<value>0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>INPUT_INVERTED_HIGH</name>												
						<description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>												
						<value>1</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>RESERVED</name>														
				<description>Reserved.</description>														
				<bitRange>[9:7]</bitRange>														
																		
													
			</field>															
			<field>															
				<name>OD</name>														
				<description>Open-drain mode.</description>														
				<bitRange>[10:10]</bitRange>														
																		
				<enumeratedValues>														
				<name>ENUM</name>														
																		
					<enumeratedValue>													
						<name>DISABLE_</name>												
						<description>Disable.</description>												
						<value>0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>OPEN_DRAIN_MODE_ENAB</name>												
						<description>Open-drain mode enabled. This is not a true open-drain mode. Input cannot be pulled up above VDD.</description>												
						<value>1</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>RESERVED</name>														
				<description>Reserved.</description>														
				<bitRange>[31:11]</bitRange>														
																		
													
			</field>															
		</fields>																
	</register>																	
	<register>																	
		<name>PIO1_23</name>																
		<description>I/O configuration for pin PIO1_23/CT16B1_MAT1/SSEL1</description>																
		<addressOffset>0x0BC</addressOffset>																
		<access>read-write</access>																
		<resetValue>0x0000090</resetValue>																
		<resetMask>0xFFFFFFFF</resetMask>																
		<fields>																
			<field>															
				<name>FUNC</name>														
				<description>Selects pin function. Values 0x3 to 0x7 are reserved.</description>														
				<bitRange>[2:0]</bitRange>														
																		
				<enumeratedValues>														
				<name>ENUM</name>														
																		
					<enumeratedValue>													
						<name>PIO1_23_</name>												
						<description>PIO1_23.</description>												
						<value>0x0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>CT16B1_MAT1_</name>												
						<description>CT16B1_MAT1.</description>												
						<value>0x1</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>SSEL1_</name>												
						<description>SSEL1.</description>												
						<value>0x2</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>MODE</name>														
				<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>														
				<bitRange>[4:3]</bitRange>														
																		
				<enumeratedValues>														
				<name>ENUM</name>														
																		
					<enumeratedValue>													
						<name>INACTIVE_NO_PULL_DO</name>												
						<description>Inactive (no pull-down/pull-up resistor enabled).</description>												
						<value>0x0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>PULL_DOWN_RESISTOR_E</name>												
						<description>Pull-down resistor enabled.</description>												
						<value>0x1</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>PULL_UP_RESISTOR_ENA</name>												
						<description>Pull-up resistor enabled.</description>												
						<value>0x2</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>REPEATER_MODE_</name>												
						<description>Repeater mode.</description>												
						<value>0x3</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>HYS</name>														
				<description>Hysteresis.</description>														
				<bitRange>[5:5]</bitRange>														
																		
				<enumeratedValues>														
				<name>ENUM</name>														
																		
					<enumeratedValue>													
						<name>DISABLE_</name>												
						<description>Disable.</description>												
						<value>0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>ENABLE_</name>												
						<description>Enable.</description>												
						<value>1</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>INV</name>														
				<description>Invert input</description>														
				<bitRange>[6:6]</bitRange>														
																		
				<enumeratedValues>														
				<name>ENUM</name>														
																		
					<enumeratedValue>													
						<name>INPUT_NOT_INVERTED_</name>												
						<description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0).</description>												
						<value>0</value>												
					</enumeratedValue>													
					<enumeratedValue>													
						<name>INPUT_INVERTED_HIGH</name>												
						<description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>												
						<value>1</value>												
					</enumeratedValue>													
				</enumeratedValues>														
			</field>															
			<field>															
				<name>RESERVED</name>														
				<description>Reserved.</description>														
				<bitRange>[9:7]</bitRange>														
																		
													
